openfoam2412-cases/stokesII/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       224100;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       224250;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          750;
        startFace       224400;
    }
    top
    {
        type            patch;
        nFaces          750;
        startFace       225150;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          225000;
        startFace       225900;
    }
)

// ************************************************************************* //
